import math


def function_first():
  """Обчислення значення виразу y = log10(x) + e^z"""
  print("\n--- Завдання 1: Обчислення значення виразу ---")
  try:
    x = float(input("Введіть значення x (x > 0): "))
    y = float(input("Введіть значення для степеня експоненти (y): "))
    if x <= 0:
      print("Помилка: аргумент логарифма має бути більшим за 0.")
      return
    Y = math.log10(x) + math.exp(y)
    print(f"Результат: x = {x}, y = {y} => Y = {Y}")
  except ValueError:
    print("Помилка: введено некоректне число.")


def function_second():
  """Знайти суму парних і добуток непарних цілих чисел у діапазоні від 0 до 20"""
  print("\n--- Завдання 2: Сума парних та добуток непарних чисел (0 - 20) ---")
  sum = 0
  odd = (
      1
  )

  for i in range(0, 21):
    if i % 2 == 0:
      sum += i
    else:
      odd *= i

  print(f"Сума парних чисел у діапазоні від 0 до 20: {sum}")
  print(f"Добуток непарних чисел у діапазоні від 0 до 20: {odd}")


def main():
  while True:
    print("\n=== ГОЛОВНЕ МЕНЮ ===")
    print("1. Обчислити значення виразу (Функція 1)")
    print(
        "2. Знайти суму парних і добуток непарних чисел у діапазоні від 0 до"
        " 20 (Функція 2)"
    )
    print("0. Вихід")

    choice = input("Оберіть номер завдання: ").strip()

    if choice == "1":
      function_first()
    elif choice == "2":
      function_second()
    elif choice == "0":
      print("Вихід з програми. До побачення!")
      break
    else:
      print("Невірний вибір. Будь ласка, введіть 1, 2 або 3.")


if __name__ == "__main__":
  main()